Revit 2026 API

# FamilyManagerGetParameter Method

---

Obtains the family parameter with the given built-in parameter identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter GetParameter(
	ForgeTypeId parameterTypeId
)
```
```vb
Public Function GetParameter (
	parameterTypeId As ForgeTypeId
) As FamilyParameter
```
```cpp
public:
FamilyParameter^ GetParameter(
	ForgeTypeId^ parameterTypeId
)
```
```fsharp
member GetParameter :
        parameterTypeId : ForgeTypeId -> FamilyParameter
```

#### Parameters

parameterTypeId ForgeTypeId
    Identifier of the built-in parameter.

#### Return Value

FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentException | parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter). |
| ArgumentNullException | A non-optional argument was NULL |

Returns  if the parameter is not found.

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace